Repository: labilezhu/graphql-java-i18n-zh_cn
Catalog: translate-omegat.tmx
Source language: en_us
Languages: zh_cn

source: See `specification <http://facebook.github.io/graphql/#sec-Normal-evaluation>`_ for details.
zh_cn: 详细见 `规范 <http://facebook.github.io/graphql/#sec-Normal-evaluation>`_ .

source: See http://graphql.org/blog/subscriptions-in-graphql-and-relay/ for more general details on graphql subscriptions.
zh_cn: 可以阅读 http://graphql.org/blog/subscriptions-in-graphql-and-relay/ 来了解订阅的背景知识。

source: See http://www.reactive-streams.org/ for more information on the reactive ``Publisher`` and ``Subscriber`` interfaces.
zh_cn: 阅读 http://www.reactive-streams.org/ 可以得到关于 ``Publisher`` 和 ``Subscriber`` 接口的更多信息。

source: See https://github.com/graphql-java/graphql-java-subscription-example for more detailed code on handling network concerns and the like.
zh_cn: 详见 https://github.com/graphql-java/graphql-java-subscription-example

source: Serializing results to JSON
zh_cn: 序列化成 JSON

source: Should be rewritten as:
zh_cn: 应该写成：

source: So ``graphql.execution.AsyncSerialExecutionStrategy`` is used by default for mutations and will ensure that each field is completed before it processes the next one and so forth.
zh_cn: 所以，为了确保一个 field 一个 field 顺序地执行更新，更新操作（mutations）默认使用 ``graphql.execution.AsyncSerialExecutionStrategy`` 策略。

source: So given a query like
zh_cn: 如以下的查询：

source: So imagine a query as follows
zh_cn: 例如以下的查询：

source: So the following code is in fact the same.
zh_cn: 下面是等效的代码：

source: So when the field name matches the Map key or the property name of the source Object, no ``DataFetcher`` is needed.
zh_cn: 所以，当Schema中的field名，与Map中的key值，或 ``Source Object`` 中的 java bean 字段名相同时，不需要为field指定 ``DataFetcher``.

source: So you can use this mechanism to change that behaviour.
zh_cn: 你可以用以下的方法去实现.

source: So you need to turn an `graphql.ExecutionResult` into a JSON payload.
zh_cn: 返回，需要把 `graphql.ExecutionResult` 对象转换为 JSON 格式包.

source: Some people may prefer not to see that in the output error list.
zh_cn: 如果你不希望这些出现在输出的错误列表中。

source: Structure your code so that the schema is statically held, perhaps in a static variable or in a singleton IoC component but build out a new ``GraphQL`` set of objects on each request.
zh_cn: i在代码中静态引用 schema 。可以是静态变量或 IoC 单件组件。但每次处理请求时，都需要创建 ``GraphQL`` 对象。

source: Subscription Data Fetchers
zh_cn: 关于订阅服务的 Data Fetchers

source: Subscription Queries
zh_cn: 订阅查询（Subscription Queries）

source: Subscription Support
zh_cn: Subscription（订阅）的支持

source: SubscriptionExecutionStrategy
zh_cn: 订阅执行策略（SubscriptionExecutionStrategy）

source: Subscriptions
zh_cn: 订阅（Subscriptions）

source: Subscriptions are not officially specified yet: ``graphql-java`` supports currently a very basic implementation where you can define a subscription in the schema with ``GraphQLSchema.Builder.subscription(...)``.
zh_cn: 订阅功能还未在规范中： ``graphql-java`` 现在只支持简单的实现 ，你可以用 ``GraphQLSchema.Builder.subscription(...)`` 在 Schema 中定义订阅。

source: Take for example the following static schema definition file called ``starWarsSchema.graphqls``:
zh_cn: 很大的 Schema IDL 文件很难查看。

source: Teams could contribute "sections" on what is being offered as the total graphql query.
zh_cn: 每个团队可以提供自己的字段集，进而合成完整的查询。

source: That is important but not a concern of the base graphql-java library.
zh_cn: 虽然这很重要，但不是作为基础 graphql-java 库应该做的。

source: The Controller example shown above works with Apollo too.
zh_cn: 上面的 Controller 例子一样可以与 Apollo 客户端交互。

source: The GraphQL type system supports the following kind of types:
zh_cn: GraphQL 类型系统支持以下类型

source: The Graphql SDL type system has another construct for modularising a schema.
zh_cn: Graphql IDL 还有其它方法去做模块化。

source: The ``AsyncExecutionStrategy`` is free to dispatch the *enemies* field at the same time as the *friends* field.
zh_cn: ``AsyncExecutionStrategy`` 策略可能会同时发起获取 *enemies* field 和 *friends* field 的操作。.

source: The ``DataFetcher`` behind a subscription field is responsible for creating the ``Publisher`` of data.
zh_cn: 订阅字段的 ``DataFetcher`` 的职责是生成一个 ``Publisher``。

source: The ``PreparsedDocumentProvider`` is a functional interface with only a get method and we can therefore pass a method reference that matches the signature into the builder.
zh_cn: ``PreparsedDocumentProvider`` 是一个函式接口（ functional interface），方法名是get。.

source: The ``Publisher<ExecutionResult>`` here is the publisher of a stream of events.
zh_cn: 这里的 ``Publisher<ExecutionResult>`` 就是流事件的发布者【译注：原文 publisher of a stream of events】。

source: The ``graphql-java`` root Logger name is ``graphql``.
zh_cn: ``graphql-java`` 的 root Logger 名字是 ``graphql``。

source: The ``graphql.execution.ExecutorServiceExecutionStrategy`` execution strategy will always dispatch each field fetch in an asynchronous manner, using the executor you give it.
zh_cn: ``graphql.execution.ExecutorServiceExecutionStrategy`` 执行策略，使用了指定的执行器（executor），来异步地执行数据获取任务。

source: The ``graphql.execution.instrumentation.Instrumentation`` interface allows you to inject code that can observe the execution of a query and also change the runtime behaviour.
zh_cn: 通过实现 ``graphql.execution.instrumentation.Instrumentation`` 接口，你可以在执行查询的过程中注入定制代码。并可以修改运行期的行为。

source: The ``query`` field is a JSON string, and the ``variables`` field is a map of variable definitions.
zh_cn: ``query`` 字段是一个 JSON 格式的字符串， ``variables`` 字段是一个 变量定义（ variable definitions) 的 map。

source: The `foo` and `fizz` attributes would be included in the resultant graphql error.
zh_cn: 那么 `foo` and `fizz` 属性将会包含在返回给调用者的graphql查询错误中.

source: The cache instance should be thread safe and shared.
zh_cn: 缓存实例应该是线程安全和可以线程间共享的。

source: The code above is written in long form.
zh_cn: 上面是旧的写法，

source: The data fetcher here is responsible for executing the mutation and returning some sensible output values.
zh_cn: 对于更新操作，DataFetcher的职责是执行数据更新行返回执行结果.

source: The data fetchers invoked can themselves return `CompletionStage`` values and this will create fully asynchronous behaviour.
zh_cn: Data fetchers 返回 `CompletionStage`` 对象，就可以全异步执行整个查询了。

source: The field selection set will applied to the underlying data and are represented just like any other graphql query.
zh_cn: 和其它 graphql 查询一样，只会发送指定的字段 。

source: The final call to ``.join()`` waits for the execution to happen.
zh_cn: 需要你需要同步等待执行结果 ，可以调用 ``.join()`` 方法.

source: The first technique is to merge multiple Schema SDL files into one logic unit.
zh_cn: 方法一是合并多个 Schema IDL 文件到一个逻辑单元（ logic unit）。

source: The following are a list of the exceptions that can be thrown all the way out of a ``graphql.execute(...)`` call.
zh_cn: 下面是调用 ``graphql.execute(...)`` 期间可能出现的异常。

source: The following are great links to read more about this
zh_cn: 下面是一些相关方案的介绍：

source: The following code uses the standard Java ``java.util.concurrent.ForkJoinPool.commonPool()`` thread executor to supply values in another thread.
zh_cn: 下面示例使用 ``java.util.concurrent.ForkJoinPool.commonPool()`` 并行执行器，用其它线程完成数据获取.

source: The following is a basic custom ``Instrumentation`` that measures overall execution time and puts it into a stateful object.
zh_cn: 下面是一个定制的 ``Instrumentation`` 。作用是测量执行时间。

source: The following query:
zh_cn: 下面的查询 ：

source: The graphql specification says that mutations MUST be executed serially and in the order in which the query fields occur.
zh_cn: Graphql 规范指出，修改操作（mutations）“必须”按照 field 的顺序来执行。

source: The graphql-java engine ensures that all the ``CompletableFuture`` objects are composed together to provide an execution result that follows the graphql specification.
zh_cn: graphql-java 保证所有 ``CompletableFuture`` 对象组合，最后生成合符 graphql 规范的执行结果.

source: The graphql-java library concentrates on providing an engine for the execution of queries according to the specification.
zh_cn: graphql-java 引擎主要的关注点是按 GraphQL 规范来执行查询。

source: The implementation in this library is based off the `reference implementation <https://github.com/graphql/graphql-js>`_.
zh_cn: 本GraphQL实现，是基于 `已有的JS参考实现 <https://github.com/graphql/graphql-js>`_ 来开发的。

source: The latest development build is available on Bintray.
zh_cn: 最近的开发中版本，可以在 Bintray 上获取.

source: The most common way to call graphql is over HTTP and to expect a JSON response back.
zh_cn: 通常，用 HTTP 方法去调用 graphql ，用 JSON 格式作为返回结果.

source: The mutation is invoked via a query like :
zh_cn: 下面是，GraphQL 更新语句的例子 :

source: The objects return by this Publisher will be mapped over the graphql query as each arrives and then sent back out as an execution result.
zh_cn: 这个 Publisher 输出的每一个对象，将会通过 graphql 查询来映射。然后作为执行结果返回。

source: The primary use case for this is to allow say performance monitoring and custom logging but it could be used for many different purposes.
zh_cn: 它的主要用途是性能监控和定制日志，但也可以完成其它任务。

source: The query is now reused regardless of variable values provided.
zh_cn: 这样，这不管查询的变量（variable）如何变化 ，查询解释也就可以重用。

source: The query result will follow the graphql specification and return object values assembled in query field order.
zh_cn: 但查询结果会按GraphQL规范顺序来返回。

source: The result of a query is an ``ExecutionResult`` which is the query data and/or a list of errors.
zh_cn: 查询将返回一个 ``ExecutionResult`` 对象，其中包含查询的结果数据 （或出错时的错误信息集合）.

source: The result of this query is displayed below.
zh_cn: 下面是查询的结果。

source: The runtime wiring contains ``DataFetcher`` s, ``TypeResolvers`` s and custom ``Scalar`` s that are needed to make a fully executable schema.
zh_cn: 这里的绑定，包括 ``DataFetcher`` , ``TypeResolvers`` 与自定义 ``Scalar``.

source: The scope of your DataLoader instances is important.
zh_cn: 所以 DataLoader 实例的范围很重要。

source: The static schema definition file ``starWarsSchema.graphqls`` contains the field and type definitions, but you need a runtime wiring to make it a truly executable schema.
zh_cn: 由于Schema中只是指定了静态的字段和类型，你还需要把它绑定到java方法中。以让Schema可以运行起来

source: The type resolver is responsible for examining a runtime object and deciding what ``GraphqlObjectType`` should be used to represent it, and hence what data fetchers and fields will be invoked.
zh_cn: Type resolver（类型识别器） 的作用是在运行时识别出 ``GraphqlObjectType`` 的具体类型（Type）。后期具体类型下的field相关的 data fetcher被调用并获取数据.

source: The use of ``CompletableFuture`` allows you to compose actions and functions that will be applied when the execution completes.
zh_cn: 使用 ``CompletableFuture`` 对象，你可以指定，在查询完成后，组合其它操作(action)或函数你的函数.

source: There are cases where you may want to restrict certain fields depending on the user.
zh_cn: 但有时候，你可能想不同用户看到不同部分的字段。

source: There is a helpful shortcut in graphql-java to create asynchronous data fetchers.
zh_cn: 还有一个方法可以简化异步 data fetchers 的编写.

source: There is also another implementation that prevents instrumentation from being able to be performed on your schema, if that is a requirement.
zh_cn: 如果你需要，还有一个实现可以防止 instrumentation 拦截你的 schema。

source: There is no special support for `Apollo <https://github.com/apollographql/apollo-client>`_ included: Apollo works with any schema.
zh_cn: 没有为对接 `Apollo <https://github.com/apollographql/apollo-client>`_ 客户端做什么。因它兼容所有schema。

source: These are not graphql errors in execution but rather totally unacceptable conditions in which to execute a graphql query.
zh_cn: 他们不是执行 graphql 查询中发生的异常。 但还是不能被忽略。

source: They will be combined in the order in which they are encountered.
zh_cn: 它们会以被发现的顺序组合起来。

source: This allows for a more dynamic runtime wiring since the SDL definitions can be examined in order to decide what to wire in.
zh_cn: 通过程序去分析 SDL ，就可以允许更自由的绑定。

source: This allows you to place your own custom attributes into the graphql error that is sent back to the caller.
zh_cn: 这可以方便你把自己的错误信息，放到返回给调用者的 GraphQL 错误列表中.

source: This behaviour is allowed in the graphql specification and in fact is actively encouraged http://facebook.github.io/graphql/#sec-Query for read only queries.
zh_cn: 对于查询，这个策略是 graphql 规范 http://facebook.github.io/graphql/#sec-Query 允许和推荐的。

source: This behaviour makes it unsuitable to be used as a mutation execution strategy.
zh_cn: 因为这样，所以它不能用于更新(mutation)操作。

source: This can be used with static imports to produce more readable code.
zh_cn: 这样可以使用 static imports 来提高代码可读性.

source: This enables you to handle a subscription request:
zh_cn: 这使你可以处理订阅请求。

source: This is a GraphQL Java implementation based on the `specification <https://github.com/facebook/graphql>`_ and the JavaScript `reference implementation <https://github.com/graphql/graphql-js>`_.
zh_cn: 这是一个用Java实现的GraphQL。基于 `GraphQL规范 <https://github.com/facebook/graphql>`_ 和 `JavaScript参考实现 <https://github.com/graphql/graphql-js>`_.

source: This is especially useful at the top level.
zh_cn: 这在顶层查询中特别有用。

source: This is important.
zh_cn: 请留意.

source: This is needed for ``Interface`` and ``Union``.
zh_cn: 所以 ``Interface`` 和 ``Union`` 均需要指定关联的 ``TypeResolver(类型识别器)`` .

source: This is the famous "hello world" in ``graphql-java``:
zh_cn: 下面就用 ``graphql-java`` 来实现经典的 "hello world" :

source: This made up example shows how you can pass yourself information to help execute your queries.
zh_cn: 下面例子演示怎么向你的查询传递信息：

source: This means you can fire off a number of field fetching requests in parallel.
zh_cn: 这样，你可以同时发起我个数据获取操作，让它们并行运行.

source: This might involve making a database call or contacting another system over HTTP say.
zh_cn: 其中可以会与database交互，或用HTTP与其它系统交互.

source: This strategy allows for the most performant execution.
zh_cn: 这个策略可以优化查询执行的性能.

source: This will ensure that the result follows the specification outlined in http://facebook.github.io/graphql/#sec-Response
zh_cn: 这样就可以确保返回数据合符在 http://facebook.github.io/graphql/#sec-Response 中的规范

source: This will make it even more timely since multiple calls can happen at once if need be.
zh_cn: 这可以让查询更快，因一次并发了多个远程调用。

source: Those arguments are what you can use to mutate your data store via the data fetcher invoked.
zh_cn: 在更新数据时，框架会带上这些参数去调用 data fetcher.

source: To avoid the need for re-parse/validate the ``GraphQL.Builder`` allows an instance of ``PreparsedDocumentProvider`` to reuse ``Document`` instances.
zh_cn: 为了避免重复的解释和校验。 ``GraphQL.Builder`` 可以使用``PreparsedDocumentProvider``去重用 ``Document`` 实例。

source: To be able to declare such a type, ``graphql-java`` has a ``GraphQLTypeReference`` class.
zh_cn: 为了方便声明这种情况， ``graphql-java`` 有一个 ``GraphQLTypeReference`` 类。

source: To ensure you get a JSON result that confirms 100% to the graphql spec, you should call `toSpecification` on the result and then send that back as JSON.
zh_cn: 为保证你返回的 JSON 结果 100% 合符 graphql 规范, 应该调用result对象的 `toSpecification` 方法，然后以 JSON格式 发送响应.

source: To execute a query against a schema build a new ``GraphQL`` object with the appropriate arguments and then call ``execute()``.
zh_cn: 为了对 一个Schema 执行查询。需要先构造一个 ``GraphQL`` 对象，并带着一些参数去调用 ``execute()`` 方法.

source: Type References (recursive types)
zh_cn: 类型引用 （Type References） (递归类型recursive types)

source: Types
zh_cn: 类型（Types）

source: Use ``graphql.schema.AsyncDataFetcher.async(DataFetcher<T>)`` to wrap a ``DataFetcher``.
zh_cn: 使用 ``graphql.schema.AsyncDataFetcher.async(DataFetcher<T>)`` 去包装``DataFetcher``.

source: Using Dataloader
zh_cn: 使用 Dataloader

source: Using ``java-dataloader`` will help you to make this a more efficient process by both caching and batching requests for that graph of data items.
zh_cn: 使用 ``java-dataloader`` 可以帮助你更有效地缓存和批量化数据加载操作。

source: Using the latest development build
zh_cn: 如何使用最新的开发中版本

source: Very basic support for `Relay <https://github.com/facebook/relay>`_ is included.
zh_cn: 包含了一些基础的 `Relay <https://github.com/facebook/relay>`_ 特性的支持。

source: We have a public chat room (Gitter.im) for graphql-java: https://gitter.im/graphql-java/graphql-java
zh_cn: 我们为graphql-java，准备了一个公开的聊天室 (Gitter.im) : https://gitter.im/graphql-java/graphql-java

source: We have put together a basic example of using websockets (backed by Jetty) with a simulated stock price application that is built using RxJava.
zh_cn: 我们编写了一个 websockets 的(基于 Jetty) 模拟股票报价的示例应用。它使用了 RxJava。

source: Welcome to graphql-java
zh_cn: 欢迎使用 graphql-java

source: What is special is that the initial result of a subscription query is a reactive-streams ``Publisher`` object which you need to use to get the future values.
zh_cn: 不同的是，一开始的查询结果是一个响应式流（reactive-streams） ``Publisher（流发布者）`` 对象。通过对象可以获取未来的数据。

source: When defining a schema via SDL, you provide the needed ``DataFetcher`` and ``TypeResolver`` when the executable schema is created.
zh_cn: 当使用SDL方法来开发时，你需要同时编写对应的 ``DataFetcher`` 和 ``TypeResolver``。

source: When one is not configured, a `PropertyDataFetcher <https://github.com/graphql-java/graphql-java/blob/master/src/main/java/graphql/schema/PropertyDataFetcher.java>`_ is used.
zh_cn: 如果未为字段指定DataFetcher, 那么自动使用默认的 `PropertyDataFetcher <https://github.com/graphql-java/graphql-java/blob/master/src/main/java/graphql/schema/PropertyDataFetcher.java>`_ .

source: When the schema is created programmatically ``DataFetcher`` s and ``TypeResolver`` s are provided at type creation:
zh_cn: 如果用程序方式来定义 Schema，在创建类型（type）的时候，你需要提供 ``DataFetcher`` and ``TypeResolver` 。

source: When the schema is created, the ``GraphQLTypeReference`` is replaced with the actual real type Object.
zh_cn: 在实际的 Schema 创建时，``GraphQLTypeReference`` 会变为实际的类型。

source: When the schema is declared via SDL, no special handling of recursive types is needed.
zh_cn: 如果用SDL（ID L）来定义 Schema ，不需要特殊的处理。

source: When you build the ```Graphql`` object you can specify what ``Instrumentation`` to use (if any).
zh_cn: 当创建 ```Graphql`` 对象时，可以绑定相关的 ``Instrumentation`` 。

source: With Java 8 lambdas it can be written more succinctly as follows
zh_cn: 也可以用Java 8 lambdas 的写法：

source: With `dataloader` you can make the `graphql` query much more efficient.
zh_cn: 使用 `dataloader` 可以让 `graphql` 查询更高效。

source: With all these type extensions in place the `Human` type now looks like this at runtime.
zh_cn: 完成合并后的 `Human` 类型会是这样的：

source: With caching turned on (the default) then any previously returned person will be returned as is for no cost.
zh_cn: 当开启了缓存功能时 (默认开启)，将直接返回之前加载过的 person，而不会再发起一次查询。

source: You are now writing reactive-streams code to consume a series of ``ExecutionResults``.
zh_cn: 需要编写 reactive-streams 代码去消费一源源不断的 ``ExecutionResults``。

source: You can change this behaviour by creating your own ``graphql.execution.DataFetcherExceptionHandler`` exception handling code and giving that to the execution strategy.
zh_cn: 你可以编写自己的 ``graphql.execution.DataFetcherExceptionHandler`` 来改变这些逻辑。只需要在执行策略（execution strategy）注册一下.

source: You can combine multiple ``Instrumentation`` objects together using the ``graphql.execution.instrumentation.ChainedInstrumentation`` class which accepts a list of ``Instrumentation`` objects and calls them in that defined order.
zh_cn: 你可以用 ``graphql.execution.instrumentation.ChainedInstrumentation`` 把多个 ``Instrumentation`` 连接起来。这些 ``Instrumentation`` 对象会按顺序被调用。

source: You can create your own derivation of `GraphqlFieldVisibility` to check what ever you need to do to work out what fields should be visible or not.
zh_cn: 你可以编写自己的 `GraphqlFieldVisibility` 来控制字段的可见性。

source: You can do this by using a `graphql.schema.visibility.GraphqlFieldVisibility` implementation and attaching it to the schema.
zh_cn: 你可以在schema 上绑定一个 `graphql.schema.visibility.GraphqlFieldVisibility` 对象。.

source: You can get the ``CompleteableFuture`` to results by calling ``executeAsync()`` like this
zh_cn: 如下，调用 ``executeAsync()`` 后，返回 ``CompleteableFuture`` ：

source: You can have as many extensions as you think sensible.
zh_cn: 你可以按你的需要去扩展。

source: You can make execution of the ``DataFetcher`` asynchronous by returning a ``CompletionStage`` to data, that is explained more further down this page.
zh_cn: 也可以通过编写异步的 ``DataFetcher`` ，异步地返回 ``CompletionStage`` 对象，在下文中将会说明使用方法.

source: You can make you own custom implementation of ``FieldValidation`` or you can use the ``SimpleFieldValidation`` class to add simple per field checks rules.
zh_cn: 你可以编写自己的``FieldValidation`` 实现，或者直接用 ``SimpleFieldValidation`` 去为每个field定义校验逻辑。

source: You can modularise you schema using two techniques.
zh_cn: 所以我们有两种方法可以模块化 Schema。

source: You can pass in a context object during query execution that will allow you to better invoke that business logic.
zh_cn: 为更方便的业务调用，你可以在查询执行中加入Context Object。

source: You can see more details on reactive-streams code here http://www.reactive-streams.org/
zh_cn: 你可以在 http://www.reactive-streams.org/ 中看到更 reactive-streams 代码的编写细节。

source: You can see that Han, Leia, Luke and R2-D2 are a tight knit bunch of friends and share many friends in common.
zh_cn: 你可以看到，Han, Leia, Luke 和 R2-D2 是一群紧密的朋友。他们有很多共同的朋友。

source: You can still return ``CompletionStage`` objects in the mutation data fetchers, however they will be executed serially and will be completed before the next mutation field data fetcher is dispatched.
zh_cn: 你的 mutation Data Fetcher 仍然可以返回 ``CompletionStage`` 对象, 但它和其它 field 的是串行执行的。

source: You can use `type extensions` to add extra fields and interfaces to a type.
zh_cn: 你可以使用 `type extensions` 去为现有类型增加字段和 interface。

source: You can use extension types to add new fields to the top level schema "query".
zh_cn: 你可以用 extension types 去为顶层 "query" 增加字段

source: You can wire in what execution strategy to use when you create the ``GraphQL`` object.
zh_cn: 你可以这样给 ``GraphQL`` 对象绑定执行策略。

source: You could for example look at SDL directives, or some other aspect of the SDL definition to help you decide what runtime to create.
zh_cn: 你可以 通过分析 SDL 声明, 或其它 SDL 定义去决定你的运行时逻辑。

source: You data fetcher is going to look something like this.
zh_cn: 你会像这样子去编写Data Fetcher：

source: You might want to create them per web request to ensure data is only cached within that web request and no more.
zh_cn: 这时，你需要对每个 Request 创建一个新的 DataLoader，来保证它只在当前请求中生效。

source: You need to push these concerns into your business logic layers.
zh_cn: 你需要在自己的业务逻辑层中实现这些。

source: You need to send in arguments during that mutation operation, in this case for the variables for ``$ep`` and ``$review``
zh_cn: 修改操作是需要带输入参数的，上例中对应变量 ``$ep`` and ``$review``

source: You need to subscribe to this with your processing code which will look something like the following
zh_cn: 你需要编写你自己的流处理代码，如：

source: You need to use ``SubscriptionExecutionStrategy`` as your execution strategy as it has the support for the reactive-streams APIs.
zh_cn: 你需要使用 ``SubscriptionExecutionStrategy`` 策略作为执行策略（execution strategy）。因为它支持 reactive-streams APIs.

source: You should push all that logic into your business logic layer code.
zh_cn: 你应该在自己的业务逻辑层，去实现这些逻辑.

source: You uses ``SubscriptionExecutionStrategy`` as your execution strategy as it has the support for the reactive-streams APIs.
zh_cn: 你可以使用 ``SubscriptionExecutionStrategy`` 执行策略，它支持 reactive-streams APIs。

source: You wire this together using this builder pattern
zh_cn: 用下页的Builder方法，就可以绑定Schema和Java程序

source: You would create types like this to handle this mutation :
zh_cn: 对应地，Schema 应该这么写【译注：以下是 Java 写法，你也可以用SDL写法】 :

source: ``PropertyDataFetcher`` fetches data from ``Map`` and Java Beans.
zh_cn: ``PropertyDataFetcher`` 从 ``Map`` 和 Java Beans 中获取数据.

source: ``RxJava`` is a popular implementation of reactive-streams.
zh_cn: ``RxJava``是这个流行的 reactive-streams 实现。

source: ``graphql-java`` is not opinionated about how you get your domain data objects, that is very much your concern.
zh_cn: ``graphql-java`` 不关心你如何获取你的业务数据，这是你的自己.

source: ``graphql-java`` offers two different ways of defining the schema: Programmatically as Java code or via a special graphql dsl (called SDL).
zh_cn: “graphql-java”提供两种方法来定义Schema。用java代码来定义、用GraphQL SDL(即IDL)来定义。

source: ``graphql-java`` requires at least Java 8.
zh_cn: ``graphql-java`` 需要运行于 Java 8 或更高版本.

source: ``graphql-java`` supports the following Scalars:
zh_cn: ``graphql-java`` 支持以下基本数据类型（ Scalars）。
